programming/theory/oop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Object-Oriented Programming</title>
<!-- 2017-02-23 Thu 09:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">Object-Oriented Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Definition</a>
<ul>
<li><a href="#sec-1-1">1.1. Composition vs Inheritance</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Principle</a></li>
<li><a href="#sec-3">3. Quote</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Definition</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> Object </dt><dd>A packet of information stored in a chunk of computer memory. <br  />
</dd>
</dl>

<p>
Every object is associated with a data type, and the data type determines what can be done to an object. <br  />
All programming languages have <b>built-in data types</b>, such as the integer data type and the character data type.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Composition vs Inheritance</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Composition</b></th>
<th scope="col" class="left">Composition is a <code>has-a</code> relationship.</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Used to package code into modules that are used in different, unrelated places and situations.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Inheritance</b></td>
<td class="left">Inheritance is a <code>is-a</code> relationship.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Used when there are related reusable pieces of code that fit under a single common concept.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Principle</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Explicit-representation</b></th>
<th scope="col" class="left">Whenever there is a natural category that the program needs to work with,</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">there should be a class that corresponds to that category.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>No-duplication</b></td>
<td class="left">Member variables and function definitions should be distributed among class</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">definitions to ensure that there is no duplication of identical code.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Local-view</b></td>
<td class="left">Related program elements should be located close to one another on the screen,</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">so that one can see at a glance how those program elements work together.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Look-it-up</b></td>
<td class="left">A program should look up a frequently needed answer, rather than computing</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">that answer, whenever practicable.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Need-to-know</b></td>
<td class="left">By restricting access to classes to the member variables and functions in</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">public interface, one can revise and improve the other member variables and</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">functions without worrying about whether other programmers have come to depend</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">on member variables that disappear or functions whose behavior changes.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><b>Keep-it-simple</b></td>
<td class="left">In general, programs with complex program elements are difficult to write,</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">to debug, to improve, and to maintain. When a function becomes too complex to</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">understand easily, it should be broke up into smaller functions that can be</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">debugged and maintained independently.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Quote</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
OOP 的本质就是对数据和与之关联的行为进行编程。OOP 注重的是：1）数据和其行为的打包封装，2）程序的接口和实现的解耦。（<a href="http://coolshell.cn/articles/8745.html">如此理解面向对象编程</a>）
</p>
</blockquote>

<blockquote>
<p>
OOD 的两大准则：1）钟情于组合而不是继承，2）依赖于接口而不是实现。（<a href="http://coolshell.cn/articles/8961.html">从面向对象的设计模式看软件设计</a>）
</p>
</blockquote>

<blockquote>
<p>
The shift from procedural to OO brings with it a shift from thinking about problems and solutions to thinking about architecture. The latter is almost always longer, full of extra interface and indentation and annotations. The temptation is to start moving trivial bits of code into classes and adding all these little methods and anticipating methods that aren't needed yet but might be someday. (<a href="http://prog21.dadgum.com/93.html">Don't Distract New Programmers with OOP</a>)
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-02-23 Thu 09:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
